Revit 2027 API
BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCurveChainBothUandV Property
 A chain formed by these curve elements is trying to be both U- and V- splitter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DividedSurfaceCurveChainBothUandV { get; }
Public Shared ReadOnly Property DividedSurfaceCurveChainBothUandV As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DividedSurfaceCurveChainBothUandV {
	FailureDefinitionId^ get ();
}
static member DividedSurfaceCurveChainBothUandV : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace